/*
변수는 크게 전역변수와 지역변수로 나뉜다.

전역변수 = 全 域 變 數 = 모든 지역에 접근할 수 있는 별명(변수)
          全 = 모두 전
          域 = 지역 역
          變 = 변할 변
          數 = 셀   수
          
지역 변수 = 地 域 變 數 = 지방 지역에서 접근할 수 있는 별명(변수)
           地 = 땅   지  지방 내에 있는 모든 지역에서만 접근 가능
           域 = 지역 역  외부 지방으로는 접근 불가!
           變 = 변할 변
           數 = 셀   수 
            
[] = 대괄호 → 특정 수, 글자들을 나열하고 정의를 내릴 때 사용
             ex) [사과, 포도, 오렌지, 딸기]
             비어있어도 됨, 값이 없어도 됨
{} = 중괄호 → 기능을 설정할 때 사용
             ex) 
             비우면 안됨, 값이 있어야 함
() = 소괄호 → 기능 명칭 뒤에 특정 값을 호출할 때 사용 
             ex) function 인사하기("대표님한테만){
             }
             비어있어도 됨, 값이 없어도 됨
<> = 부등호 → 크고 작음을 나타낼 때 사용(괄호는 아님, 등호)            
*/
